Repository: simplivity/distcc
Catalog: debian/po/*.po
Languages: tr

source: Start the distcc daemon on startup?
tr: distcc bekletici programı açılışta başlatılsın mı?

source: distcc can be run as a daemon, listening on port 3632 for incoming connections.
tr: distcc bekletici program (daemon) olarak çalışabilir ve gelen bağlantılar için 3632 numaralı portu dinleyebilir.

source: You have the option of starting the distcc daemon automatically on the computer startup. If in doubt, it's advised not to start it automatically on startup. If you later change your mind, you can run: 'dpkg-reconfigure distcc'.
tr: distcc bekletici programını bilgisayar açıldığında otomatik olarak başlatabilirsiniz. Eğer kararsızsanız, programı otomatik olarak başlatmamanız önerilir. Daha sonra fikrinizi değiştirirseniz 'dpkg-reconfigure distcc' komutunu kullanabilirsiniz.

source: Allowed client networks:
tr: İzin verilen istemci ağlar:

source: The distcc daemon implements access control based on the IP address of the client, that is trying to connect. Only the hosts or networks listed here are allowed to connect.
tr: distcc bekletici programı, kendisine bağlanmaya çalışan istemcilerin IP adreslerini temel alan bir erişim denetimi kullanır. Programa sadece burada listelenen makineler ve ağların bağlanmasına izin verilecek.

source: You can list multiple hosts and/or networks, separated by spaces. Hosts are represented by their IP address, networks have to be in CIDR notation, f.e. "192.168.1.0/24".
tr: Birden fazla makine ve/veya ağı, boşluklarla ayrılmış biçimde listeleyebilirsiniz. Makineler IP adresiyle temsil edilir. Ağlar ise CIDR gösterim biçiminde olmalıdır, "192.168.1.0/24" gibi.

source: To change the list at a later point, you can run: 'dpkg-reconfigure distcc'.
tr: Bu listeyi daha sonra değiştirmek için 'dpkg-reconfigure distcc' komutunu kullanabilirsiniz.

source: Listen interfaces:
tr: Dinlenecek arayüzler:

source: The distcc daemon can be bound to a specific network interface.
tr: distcc bekletici programı belirli bir ağ arayüzünü dinleyecek şekilde sınırlandırılabilir.

source: You probably want to choose the interface of your local network by entering its IP address. If distccd should listen on all interfaces, just enter nothing.
tr: Büyük olasılıkla yerel ağınızın arayüzünü seçmek isteyeceksiniz. Bunun için bu arayüzün IP adresini girin. Eğer distccd'nin tüm arayüzleri dinlemesi gerekiyorsa hiç bir şey girmeyin.

source: Be sure to protect distccd from unauthorized access, by being careful in your choice of the listen interface and allowed networks. distccd should never be accessible from untrusted networks. If that is needed, secureshell should be used instead of the daemon.
tr: distccd'nin yetkisiz erişimlerden korunduğuna emin olun. Bunun için dinlenecek arayüz ve izin verilen ağların seçiminde dikkatli olun. distccd'ye güvenilmeyen ağlardan hiç bir şekilde erişilememelidir. Eğer güvenilmeyen ağlardan erişim gerekliyse bekletici program yerine secureshell kullanılmalıdır.

source: To change the address at a later point, you can run: 'dpkg-reconfigure distcc'.
tr: Adresi daha sonra değiştirmek için 'dpkg-reconfigure distcc' komutunu kullanabilirsiniz.

source: Nice level:
tr: Öncelik düzeyi:

source: You can start the distcc daemon with a nice level, to give it a low priority compared to other processes. The start script will only accept values between 0 and 20.
tr: distcc bekletici programına diğer işlemlerden daha düşük bir öncelik vermek için bekletici programı bir öncelik değeriyle başlatabilirsiniz. Başlatma betiği sadece 0 ve 20 arasındaki değerleri kabul eder.

source: To change this value at a later point, you can run: 'dpkg-reconfigure distcc'.
tr: Bu değeri daha sonra değiştirmek için 'dpkg-reconfigure distcc' komutunu kullanabilirsiniz.

source: Enable Zeroconf support?
tr: Zeroconf desteği etkinleştirilsin mi?

source: distcc has Zeroconf support.
tr: distcc'nin Zeroconf desteği var

source: If you enable it here, please read /usr/share/doc/distcc/README.Debian to learn how clients must be configured to make use of it. Also note, that you need to install the dbus package, if you're going to use Zeroconf.
tr: Eğer Zeroconf desteğini etkinleştirirseniz, istemcilerin nasıl bunu kullanacak şekilde yapılandırılacağını öğrenmek için /usr/share/doc/distcc/README.Debian'ı okuyun.Zeroconf kullanacaksanız dbus paketini yüklemeniz gerekmektedir.
